back-end/load-tests/get-main.yml
## GET from /countries/list
## This is the list of countries that renders in the dropdown menu on the homepage

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 20
      arrivalRate: 100
    - duration: 60
      arrivalRate: 50
    - duration: 20
      arrivalRate: 100
scenarios:
  - flow:
    - get:
        url: "/countries/list"